tkashi-github/IMXRT1060-EVK/IMXRT1060-EVK_APL/source/UserDriver/SAI/DrvSAI.c
	/* Initialize SAI Rx */
	SAI_RxGetDefaultConfig(&config);
	SAI_RxInit(base[enSAI], &config);

	/* Configure the audio format */
	format.bitWidth = enPcmBit;
	format.channel = 0U;
	format.sampleRate_Hz = enSampleRate;
#if (defined FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER && FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER) || \
	(defined FSL_FEATURE_PCC_HAS_SAI_DIVIDER && FSL_FEATURE_PCC_HAS_SAI_DIVIDER)
	format.masterClockHz = kOverSampleRate * format.sampleRate_Hz;
#else
	u32BclkSrcHz = (CLOCK_GetFreq(kCLOCK_AudioPllClk) / (SaiDivVal + 1U));
#endif
	//mimic_printf("[%s (%d)] format.masterClockHz = %lu\r\n", __func__, __LINE__, format.masterClockHz);

	format.protocol = config.protocol;
	format.stereo = kSAI_Stereo;

#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	format.watermark = FSL_FEATURE_SAI_FIFO_COUNT / 2U;
#endif

	/* Reset codec */
	sts = CODEC_Init(&s_HndCodec[enSAI], &boardCodecConfig);
	if (kStatus_Success != sts)
	{
		mimic_printf("[%s (%d)] CODEC_Init NG : %d\r\n", __func__, __LINE__, sts);
		return false;
	}
	sts = CODEC_Deinit(&s_HndCodec[enSAI]);
	if (kStatus_Success != sts)
	{
		mimic_printf("[%s (%d)] CODEC_Init NG : %d\r\n", __func__, __LINE__, sts);
		return false;
	}

	/* Use default setting to init codec */
	sts = CODEC_Init(&s_HndCodec[enSAI], &boardCodecConfig);
	if (kStatus_Success != sts)
	{
		mimic_printf("[%s (%d)] CODEC_Init NG : %d\r\n", __func__, __LINE__, sts);
		return false;
	}
	sts = CODEC_SetFormat(&s_HndCodec[enSAI], u32BclkSrcHz, format.sampleRate_Hz, format.bitWidth);
	if (kStatus_Success != sts)
	{
		mimic_printf("[%s (%d)] CODEC_SetFormat NG : %d\r\n", __func__, __LINE__, sts);
		return false;
	}

	if (bRec)
	{
		/** 作動マイクの場合 */
		WM8960_SetLeftInput(&s_HndCodec[enSAI], kWM8960_InputDifferentialMicInput3);
		WM8960_SetRightInput(&s_HndCodec[enSAI], kWM8960_InputDifferentialMicInput2);

		/**ライン入力 */
		//WM8960_SetLeftInput(&s_HndCodec[enSAI], kWM8960_InputLineINPUT3);
		//WM8960_SetRightInput(&s_HndCodec[enSAI], kWM8960_InputLineINPUT3);
	}
	memset(s_phndSaiDmaTx[enSAI], 0, sizeof(sai_edma_handle_t));
	memset(s_phndSaiDmaRx[enSAI], 0, sizeof(sai_edma_handle_t));

	SAI_TransferTxCreateHandleEDMA(base[enSAI], s_phndSaiDmaTx[enSAI], txCallback, NULL, &s_hndDmaTx[enSAI]);
	SAI_TransferRxCreateHandleEDMA(base[enSAI], s_phndSaiDmaRx[enSAI], rxCallback, NULL, &s_hndDmaRx[enSAI]);

	SAI_TransferTxSetFormatEDMA(base[enSAI], s_phndSaiDmaTx[enSAI], &format, kSAIClockFreq, u32BclkSrcHz);
	SAI_TransferRxSetFormatEDMA(base[enSAI], s_phndSaiDmaRx[enSAI], &format, kSAIClockFreq, u32BclkSrcHz);

#if 1
	{
		edma_channel_Preemption_config_t preempCondif = {
			.enableChannelPreemption = false,
			.enablePreemptAbility = true,
			.channelPriority = kDmaTxChannel[enSAI], /** 0 - 15 */
		};
		EDMA_SetChannelPreemptionConfig(DMA0, kDmaTxChannel[enSAI], &preempCondif);
		preempCondif.channelPriority = kDmaRxChannel[enSAI];
		EDMA_SetChannelPreemptionConfig(DMA0, kDmaRxChannel[enSAI], &preempCondif);
	}
#endif
	/* Enable interrupt to handle FIFO error */
	SAI_TxEnableInterrupts(base[enSAI], kSAI_FIFOErrorInterruptEnable);
	SAI_RxEnableInterrupts(base[enSAI], kSAI_FIFOErrorInterruptEnable);
	NVIC_SetPriority(TxIrq[enSAI], kIRQ_PRIORITY_SAI);
	EnableIRQ(TxIrq[enSAI]);
	NVIC_SetPriority(RxIrq[enSAI], kIRQ_PRIORITY_SAI);
	EnableIRQ(RxIrq[enSAI]);

	SAI_TransferTerminateSendEDMA(base[enSAI], s_phndSaiDmaTx[enSAI]);
	SAI_TransferTerminateReceiveEDMA(base[enSAI], s_phndSaiDmaRx[enSAI]);
	SAI_TxSoftwareReset(base[enSAI], kSAI_ResetAll);
	SAI_RxSoftwareReset(base[enSAI], kSAI_ResetAll);
	SAI_TxClearStatusFlags(base[enSAI], kSAI_WordStartFlag | kSAI_SyncErrorFlag | kSAI_FIFOErrorFlag | kSAI_FIFORequestFlag | kSAI_FIFOWarningFlag);
	SAI_RxClearStatusFlags(base[enSAI], kSAI_WordStartFlag | kSAI_SyncErrorFlag | kSAI_FIFOErrorFlag | kSAI_FIFORequestFlag | kSAI_FIFOWarningFlag);

	DrvSAITxReset(enSAI);
	DrvSAIRxReset(enSAI);

	return true;
}

void DrvSAITxReset(enSAI_t enSAI)
{

	if ((enSAI < enSAI1) || (enSAI >= enNumOfSAI))
	{
		return;
	}

	/* Reset SAI Tx internal logic */
	//
	osEventFlagsClear(g_efSAITx[enSAI], 0x03);

	s_u32BeginCount[enSAI] = 0;
	s_u32SendCount[enSAI] = 0;
	s_u32Index[enSAI] = 0;
	s_u32TxEmptyBlock[enSAI] = kAudioBufferNum;
}
void DrvSAIRxReset(enSAI_t enSAI)
{
	if ((enSAI < enSAI1) || (enSAI >= enNumOfSAI))
	{
		return;
	}

	/* Reset SAI Rx internal logic */
	//
	osEventFlagsClear(g_efSAIRx[enSAI], 0x03);

	s_u32FullBlock[enSAI] = 0;
	s_u32ReadIndex[enSAI] = 0;
}
void DrvSAIRxEDMABufferRestart(enSAI_t enSAI)
{
	I2S_Type *base[enNumOfSAI] = {SAI1, SAI2};
	if ((enSAI < enSAI1) || (enSAI >= enNumOfSAI))
	{
		return;
	}
	//mimic_printf("[%s (%d)] ENTER\r\n", __func__, __LINE__);

	SAI_TransferTerminateReceiveEDMA(base[enSAI], s_phndSaiDmaRx[enSAI]);
	//mimic_printf("[%s (%d)] s_phndSaiDmaRx[enSAI]->state = %d\r\n", __func__, __LINE__, s_phndSaiDmaRx[enSAI]->state);
	s_u32ReadIndex[enSAI] = 0;
	s_u32FullBlock[enSAI] = 0;
	for (uint32_t i = 0; i < kAudioRxBufferNum; i++)
	{
		sai_transfer_t stxfer = {0};
		stxfer.dataSize = s_u32EDMARxBufSize[enSAI];
		stxfer.data = &s_RxAudioBuff[enSAI][i * s_u32EDMARxBufSize[enSAI]];
		if (kStatus_Success != SAI_TransferReceiveEDMA(base[enSAI], s_phndSaiDmaRx[enSAI], &stxfer))
		{
			mimic_printf("[%s (%d)] TP\r\n", __func__, __LINE__);
		}
	}
	//mimic_printf("[%s (%d)] s_phndSaiDmaRx[enSAI]->state = %d\r\n", __func__, __LINE__, s_phndSaiDmaRx[enSAI]->state);
	//mimic_printf("[%s (%d)] EXIT\r\n", __func__, __LINE__);
}
_Bool DrvSAIIsTxBufferEmpty(enSAI_t enSAI)
{
	_Bool bTxBufferEmpty = false;
	I2S_Type *base[enNumOfSAI] = {SAI1, SAI2};
	size_t u32Cnt;

	if ((enSAI < enSAI1) || (enSAI >= enNumOfSAI))
	{
		return false;
	}

	if (kStatus_Success == SAI_TransferGetSendCountEDMA(base[enSAI], s_phndSaiDmaTx[enSAI], &u32Cnt))
	{
		if (u32Cnt == 0)
		{
			bTxBufferEmpty = true;
		}
	}

	return bTxBufferEmpty;
}
_Bool DrvSAIIsStop(enSAI_t enSAI)
{
	return s_bIsTxFinished[enSAI];
}

_Bool DrvSAITx(enSAI_t enSAI, const uint8_t pu8[], uint32_t u32ByteCnt)
{
	sai_transfer_t stxfer = {0};
	uint32_t u32TxCnt = 0;
	uint32_t u32RemainSize = u32ByteCnt;
	I2S_Type *base[enNumOfSAI] = {SAI1, SAI2};

	while (u32RemainSize != 0)
	{
		/* Transfer data already prepared, so while there is any
        empty slot, just transfer */
		if (s_u32TxEmptyBlock[enSAI] > 0)
		{
			uint32_t index = s_u32Index[enSAI] * s_u32EDMATxBufSize[enSAI];

			stxfer.data = &s_TxAudioBuff[enSAI][index];

			/** 24bit PCMは細工が必要 */
			if (s_sai_word_width[enSAI] == kSAI_WordWidth24bits)
			{
				uint32_t u32 = s_u32EDMATxBufSize[enSAI];
				u32 /= 4;
				u32 *= 3;
				if (u32RemainSize <= u32)
				{
					stxfer.dataSize = (u32RemainSize * 4) / 3;
					u32RemainSize = 0;
				}
				else
				{
					stxfer.dataSize = s_u32EDMATxBufSize[enSAI];
					u32RemainSize -= u32;
				}
			}
			else
			{
				if (u32RemainSize <= s_u32EDMATxBufSize[enSAI])
				{
					stxfer.dataSize = u32RemainSize;
					u32RemainSize = 0;
				}
				else
				{
					stxfer.dataSize = s_u32EDMATxBufSize[enSAI];
					u32RemainSize -= s_u32EDMATxBufSize[enSAI];
				}
			}

			uint32_t u32ByteCnt = stxfer.dataSize;
			if ((u32ByteCnt % 32) != 0)
			{
				//				memset(&pu8[u32ByteCnt], 0, 32 - u32ByteCnt % 32);
				u32ByteCnt += (32 - (u32ByteCnt % 32));
				stxfer.dataSize = u32ByteCnt;
			}

			/** 24bit PCMは細工が必要 */
			if (s_sai_word_width[enSAI] == kSAI_WordWidth16bits)
			{
				memcpy(&s_TxAudioBuff[enSAI][index], &pu8[u32TxCnt], u32ByteCnt);
				u32TxCnt += u32ByteCnt;
			}
			else if (s_sai_word_width[enSAI] == kSAI_WordWidth24bits)
			{
				for (uint32_t i = 0; i < u32ByteCnt; i += 4)
				{
					s_TxAudioBuff[enSAI][index + i] = pu8[u32TxCnt];
					s_TxAudioBuff[enSAI][index + i + 1] = pu8[u32TxCnt + 1];
					s_TxAudioBuff[enSAI][index + i + 2] = pu8[u32TxCnt + 2];
					s_TxAudioBuff[enSAI][index + i + 3] = 0;
					u32TxCnt += 3;
				}
			}
			else
			{
				memcpy(&s_TxAudioBuff[enSAI][index], &pu8[u32TxCnt], u32ByteCnt);
				u32TxCnt += u32ByteCnt;
			}
			__DMB();
			s_bIsTxFinished[enSAI] = false;
			status_t sts = SAI_TransferSendEDMA(base[enSAI], s_phndSaiDmaTx[enSAI], &stxfer);
			/* Shall make sure the sai buffer queue is not full */
			if (sts == kStatus_Success)
			{
				s_u32Index[enSAI]++;
				s_u32Index[enSAI] %= kAudioBufferNum;
				s_u32BeginCount[enSAI]++;

				/**  */
				s_u32TxEmptyBlock[enSAI]--;
			}
			else
			{
				return false;
			}
			{
				uint32_t u32EDMAError = EDMA_GetErrorStatusFlags(DMA0);
				if ((kEDMA_ValidFlag & u32EDMAError) != 0)
				{
					mimic_printf("[%s (%d)] u32EDMAError = 0x%08lX\r\n", __func__, __LINE__, u32EDMAError);
				}
			}
		}
		else
		{
			/** Event Wait */
			uint32_t uxBits;
			uxBits = osEventFlagsWait(g_efSAITx[enSAI], 3, osFlagsWaitAny, 5000);
			if (uxBits != 1)
			{
				mimic_printf("[%s (%d)] uxBits = 0x%08lX\r\n", __func__, __LINE__, uxBits);
				if ((uxBits & 0x80000000u) != 0)
				{
					mimic_printf("[%s (%d)] osEventFlagsWait NG(u32RemainSize = %lu)\r\n", __func__, __LINE__, u32RemainSize);
				}
				else
				{
					/** EDMAが停止 */
				}
				return false;
			}
			else
			{
				/* NOP */
			}
		}
	}

