tkashi-github/IMXRT1060-EVK/IMXRT1060-EVK_APL/source/UserDriver/SAI/DrvSAI.c
	//mimic_printf("[%s (%d)] TxDone : %lu bytes\r\n", __func__, __LINE__, u32ByteCnt);
	return true;
}

/** 受信バッファサイズ固定(kAudioRxBufferMaxSize) */
_Bool DrvSAIRx(enSAI_t enSAI, uint8_t pu8[], uint32_t *pu32RxCnt)
{

	I2S_Type *base[enNumOfSAI] = {SAI1, SAI2};

	for (;;)
	{
		uint32_t u32EDMAError = EDMA_GetErrorStatusFlags(DMA0);
		if ((kEDMA_ValidFlag & u32EDMAError) != 0)
		{
			mimic_printf("[%s (%d)] EDMA_GetErrorStatusFlags = 0x%08lX\r\n", __func__, __LINE__, u32EDMAError);
		}

		if (s_u32FullBlock[enSAI] > 0)
		{
			s_u32FullBlock[enSAI]--;

			/** 受信したブロックがある */
			uint32_t index = s_u32ReadIndex[enSAI] * s_u32EDMARxBufSize[enSAI];
			//mimic_printf("index = %lu\r\n", s_u32ReadIndex[enSAI]);

			if (s_sai_word_width[enSAI] == kSAI_WordWidth16bits)
			{
				memcpy(pu8, &s_RxAudioBuff[enSAI][index], s_u32EDMARxBufSize[enSAI]);
				*pu32RxCnt = s_u32EDMARxBufSize[enSAI];
			}
			else if (s_sai_word_width[enSAI] == kSAI_WordWidth24bits)
			{
				/** 24bit PCMは細工が必要 */
				uint32_t u32RxCnt = 0;
				for (uint32_t i = 0; i < s_u32EDMARxBufSize[enSAI]; i += 4)
				{
					pu8[u32RxCnt] = s_RxAudioBuff[enSAI][index + i];
					pu8[u32RxCnt + 1] = s_RxAudioBuff[enSAI][index + i + 1];
					pu8[u32RxCnt + 2] = s_RxAudioBuff[enSAI][index + i + 2];
					u32RxCnt += 3;
				}
				*pu32RxCnt = u32RxCnt;
			}
			else
			{
				memcpy(pu8, &s_RxAudioBuff[enSAI][index], s_u32EDMARxBufSize[enSAI]);
				*pu32RxCnt = s_u32EDMARxBufSize[enSAI];
			}
			__DMB();
			{
				sai_transfer_t stxfer = {0};
				status_t sts;
				stxfer.dataSize = s_u32EDMARxBufSize[enSAI];
				stxfer.data = &s_RxAudioBuff[enSAI][s_u32ReadIndex[enSAI] * s_u32EDMARxBufSize[enSAI]];
				sts = SAI_TransferReceiveEDMA(base[enSAI], s_phndSaiDmaRx[enSAI], &stxfer);
				if (kStatus_Success != sts)
				{
					mimic_printf("[%s (%d)] SAI_TransferReceiveEDMA NG(%d)\r\n", __func__, __LINE__, sts);
					return false;
				}
			}
			s_u32ReadIndex[enSAI]++;
			s_u32ReadIndex[enSAI] %= kAudioRxBufferNum;
			break;
		}
		else
		{
			uint32_t uxBits;
			uxBits = osEventFlagsWait(g_efSAIRx[enSAI], 3, osFlagsWaitAny, 10000);
			if (uxBits != 1)
			{
				if ((uxBits & 0x80000000u) != 0)
				{
					size_t u32ReadCnt = 0;
					mimic_printf("[%s (%d)] s_phndSaiDmaRx[enSAI]->state = %d\r\n", __func__, __LINE__, s_phndSaiDmaRx[enSAI]->state);
					if (kStatus_Success == SAI_TransferGetReceiveCountEDMA(base[enSAI], s_phndSaiDmaRx[enSAI], &u32ReadCnt))
					{
						mimic_printf("[%s (%d)] u32ReadCnt = %d\r\n", __func__, __LINE__, u32ReadCnt);
					}
					*pu32RxCnt = u32ReadCnt;
					mimic_printf("[%s (%d)] osEventFlagsWait NG\r\n", __func__, __LINE__);
					mimic_printf("[%s (%d)] EDMA_GetErrorStatusFlags   = 0x%08lX\r\n", __func__, __LINE__, EDMA_GetChannelStatusFlags(DMA0, kDmaRxChannel[enSAI]));
					mimic_printf("[%s (%d)] EDMA_GetChannelStatusFlags = 0x%08lX\r\n", __func__, __LINE__, EDMA_GetErrorStatusFlags(DMA0));
					mimic_printf("[%s (%d)] TCD[%lu] CSR = 0x%08lX\r\n", __func__, __LINE__, kDmaRxChannel[enSAI], s_phndSaiDmaRx[enSAI]->dmaHandle->base->TCD[kDmaRxChannel[enSAI]].CSR);
					mimic_printf("[%s (%d)] EEI = 0x%08lX\r\n", __func__, __LINE__, s_phndSaiDmaRx[enSAI]->dmaHandle->base->EEI);
					mimic_printf("[%s (%d)] INT = 0x%08lX\r\n", __func__, __LINE__, s_phndSaiDmaRx[enSAI]->dmaHandle->base->INT);
					mimic_printf("[%s (%d)] CR  = 0x%08lX\r\n", __func__, __LINE__, s_phndSaiDmaRx[enSAI]->dmaHandle->base->CR);
					mimic_printf("[%s (%d)] ERQ = 0x%08lX\r\n", __func__, __LINE__, s_phndSaiDmaRx[enSAI]->dmaHandle->base->ERQ);
				}
				else
				{
					/** EDMAが停止 */
					mimic_printf("[%s (%d)] Immidiate Stop !!\r\n", __func__, __LINE__);
					uint32_t index = s_u32ReadIndex[enSAI] * s_u32EDMARxBufSize[enSAI];
					size_t u32ReadCnt;
					s_u32ReadIndex[enSAI] = 0;

					if (kStatus_Success != SAI_TransferGetReceiveCountEDMA(base[enSAI], s_phndSaiDmaRx[enSAI], &u32ReadCnt))
					{
						u32ReadCnt = 0;
					}
					if (s_sai_word_width[enSAI] == kSAI_WordWidth24bits)
					{
						/** 24bit PCMは細工が必要 */
						uint32_t u32RxCnt = 0;
						for (uint32_t i = 0; i < u32ReadCnt; i += 4)
						{
							pu8[u32RxCnt] = s_RxAudioBuff[enSAI][index + i];
							u32RxCnt++;
							pu8[u32RxCnt] = s_RxAudioBuff[enSAI][index + i + 1];
							u32RxCnt++;
							pu8[u32RxCnt] = s_RxAudioBuff[enSAI][index + i + 2];
							u32RxCnt++;
						}
						*pu32RxCnt = u32RxCnt;
					}
					else
					{
						memcpy(pu8, &s_RxAudioBuff[enSAI][index], u32ReadCnt);
						*pu32RxCnt = u32ReadCnt;
					}
				}
				return false;
			}
		}
	}

	return true;
}

_Bool DrvSAIImmidiateTxStop(enSAI_t enSAI)
{
	I2S_Type *base[enNumOfSAI] = {SAI1, SAI2};

	if ((enSAI < enSAI1) || (enSAI >= enNumOfSAI))
	{
		return false;
	}
	s_bIsTxFinished[enSAI] = true;

	SAI_TransferTerminateSendEDMA(base[enSAI], s_phndSaiDmaTx[enSAI]);
	osEventFlagsSet(g_efSAITx[enSAI], 0x02);
	return true;
}
_Bool DrvSAIImmidiateRxStop(enSAI_t enSAI)
{
	I2S_Type *base[enNumOfSAI] = {SAI1, SAI2};

	if ((enSAI < enSAI1) || (enSAI >= enNumOfSAI))
	{
		return false;
	}
	s_bIsRxFinished[enSAI] = true;

	SAI_TransferTerminateReceiveEDMA(base[enSAI], s_phndSaiDmaRx[enSAI]);
	osEventFlagsSet(g_efSAIRx[enSAI], 0x02);

	return true;
}

uint32_t DrvSAIReadVolume(enSAI_t enSAI)
{
	if ((enSAI < enSAI1) || (enSAI >= enNumOfSAI))
	{
		return 0;
	}
	return WM8960_GetVolume(&s_HndCodec[enSAI], kWM8960_ModuleHP);
}
_Bool DrvSAIWriteVolume(enSAI_t enSAI, uint16_t u16Vol)
{
	if ((enSAI < enSAI1) || (enSAI >= enNumOfSAI))
	{
		return false;
	}
	if (WM8960_SetVolume(&s_HndCodec[enSAI], kWM8960_ModuleHP, u16Vol) == kStatus_Success)
	{
		if (u16Vol != WM8960_GetVolume(&s_HndCodec[enSAI], kWM8960_ModuleHP))
		{
			mimic_printf("[%s (%d)] Verify NG (u16Vol = %lu) \r\n", __func__, __LINE__, u16Vol);
			return false;
		}

		return true;
	}
	else
	{
		mimic_printf("[%s (%d)] WM8960_SetVolume NG\r\n", __func__, __LINE__);
		return false;
	}
}
